public/roam/math/inner_product_space.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-10 Fri 01:20 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inner Product Space</title>
<meta name="generator" content="Org Mode" />
<meta name="color-scheme" content="light" />
<link rel="stylesheet" href="../../css/style.css?v=20260410-8" />
<link rel="shortcut icon" href="https://raw.githubusercontent.com/AaronHnoraA/AaronHnoraA.github.io/refs/heads/master/css/cv.svg" type="image/x-icon">

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Inner Product Space</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org98a18fc">Inner Product Space 内积空间</a></li>
<li><a href="#orgb67bf99">内积的公理化定义</a></li>
<li><a href="#orgdec5f4a">实内积空间与复内积空间</a></li>
<li><a href="#org1d5b87d">正交的定义</a></li>
<li><a href="#orgd7b8f65">定义顺序的分歧（数学 vs 物理）</a>
<ul>
<li><a href="#org0650da2">数学上的约定</a></li>
<li><a href="#org6bffa80">物理学（狄拉克符号）的约定</a></li>
<li><a href="#orge714f0d">重要说明</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org98a18fc" class="outline-2">
<h2 id="org98a18fc">Inner Product Space 内积空间</h2>
<div class="outline-text-2" id="text-org98a18fc">
<ul class="org-ul">
<li>标量域 $F$：
<ul class="org-ul">
<li>\(\mathbb{R}\)（实数）</li>
<li>\(\mathbb{C}\)（复数）</li>
</ul></li>

<li>\(V\) 是定义在域 \((F,+,\times)\) 上的向量空间
<ul class="org-ul">
<li>向量加法：\(\oplus\)</li>
<li>标量乘法：\(\cdot\)</li>
</ul></li>

<li>给定一个二元函数</li>
</ul>
<p>
\[
f: V \times V \to F
\]
通常记作：
\[
f(v,w) = \langle v,w\rangle
\]
</p>
</div>
</div>
<div id="outline-container-orgb67bf99" class="outline-2">
<h2 id="orgb67bf99">内积的公理化定义</h2>
<div class="outline-text-2" id="text-orgb67bf99">
<p>
若 \(\langle\cdot,\cdot\rangle\) 满足下表中的全部条件，则称其为 \(V\) 上的一个 *内积*。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">性质名称</th>
<th scope="col" class="org-left">前提条件</th>
<th scope="col" class="org-left">数学表述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">共轭对称</td>
<td class="org-left">\(\forall v,w\in V\)</td>
<td class="org-left">\(\langle v,w\rangle = \overline{\langle w,v\rangle}\)</td>
</tr>

<tr>
<td class="org-left">加法线性</td>
<td class="org-left">\(\forall v,w,a\in V\)</td>
<td class="org-left">\(\langle v\oplus w, a\rangle = \langle v,a\rangle + \langle w,a\rangle\)</td>
</tr>

<tr>
<td class="org-left">齐次线性</td>
<td class="org-left">\(\forall v,w\in V,\ \forall \lambda\in F\)</td>
<td class="org-left">\(\langle \lambda\cdot v, w\rangle = \lambda\,\langle v,w\rangle\)</td>
</tr>

<tr>
<td class="org-left">非负性</td>
<td class="org-left">\(\forall v\in V\)</td>
<td class="org-left">\(\langle v,v\rangle \ge 0\)</td>
</tr>

<tr>
<td class="org-left">非退化性</td>
<td class="org-left">\(\forall v\in V\)</td>
<td class="org-left">\(\langle v,v\rangle = 0 \iff v=0_V\)</td>
</tr>
</tbody>
</table>

<p>
📌 以上线性条件是指 *对第一个变量线性*。
</p>
</div>
</div>
<div id="outline-container-orgdec5f4a" class="outline-2">
<h2 id="orgdec5f4a">实内积空间与复内积空间</h2>
<div class="outline-text-2" id="text-orgdec5f4a">
<ul class="org-ul">
<li>若 \(F=\mathbb{R}\)，称 \(V\) 为 <b>实内积空间</b></li>
<li>若 \(F=\mathbb{C}\)，称 \(V\) 为 <b>复内积空间</b></li>
</ul>
</div>
</div>
<div id="outline-container-org1d5b87d" class="outline-2">
<h2 id="org1d5b87d">正交的定义</h2>
<div class="outline-text-2" id="text-org1d5b87d">
<p>
若
\[
\langle v,w\rangle = 0
\]
则记为
\[
v \perp w
\]
</p>

<p>
称 \(v\) 与 \(w\) <b>正交（orthogonal / perpendicular）</b>
</p>
</div>
</div>
<div id="outline-container-orgd7b8f65" class="outline-2">
<h2 id="orgd7b8f65">定义顺序的分歧（数学 vs 物理）</h2>
<div class="outline-text-2" id="text-orgd7b8f65">
</div>
<div id="outline-container-org0650da2" class="outline-3">
<h3 id="org0650da2">数学上的约定</h3>
<div class="outline-text-3" id="text-org0650da2">
<ul class="org-ul">
<li>内积对 <b>第一个变量线性</b></li>
<li>对第二个变量共轭线性</li>
</ul>

<p>
这是线性代数、泛函分析中的主流约定。
</p>
</div>
</div>
<div id="outline-container-org6bffa80" class="outline-3">
<h3 id="org6bffa80">物理学（狄拉克符号）的约定</h3>
<div class="outline-text-3" id="text-org6bffa80">
<p>
为配合 \(\langle \psi | \phi \rangle\) 的书写顺序，物理学家常采用相反的线性约定：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">性质</th>
<th scope="col" class="org-left">数学表述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">加法线性</td>
<td class="org-left">\(\langle a, v\oplus w\rangle = \langle a,v\rangle + \langle a,w\rangle\)</td>
</tr>

<tr>
<td class="org-left">齐次线性</td>
<td class="org-left">\(\langle v, \lambda\cdot w\rangle = \lambda\,\langle v,w\rangle\)</td>
</tr>
</tbody>
</table>

<p>
即：*对第二个变量线性*。
</p>
</div>
</div>
<div id="outline-container-orge714f0d" class="outline-3">
<h3 id="orge714f0d">重要说明</h3>
<div class="outline-text-3" id="text-orge714f0d">
<ul class="org-ul">
<li>真正影响定理形式的是“线性作用在哪个变量”</li>
<li>两种定义在数学上是等价的</li>
<li>但使用公式和定理时，必须保持顺序一致</li>
</ul>


<p>
1 现有内积
2 内积又到长度
3 长度诱导的范数
4 范数诱导的距离
5 距离看极限
6 内积空间的完备性
</p>
</div>
</div>
</div>
</div>
</body>
</html>
